case/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  Microfiber filter v8 - OpenFOAM case (values filled by scripts/setup_case.py)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}

dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 1;
boundaryField
{
    inlet    { type turbulentMixingLengthFrequencyInlet; mixingLength 0.0015; value uniform 10; }
    outlet   { type inletOutlet; inletValue uniform 1; value uniform 1; }
    overflow { type inletOutlet; inletValue uniform 1; value uniform 1; }
    walls    { type omegaWallFunction; value uniform 1; }
}
