case/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Microfiber filter v8 - OpenFOAM case (values filled by scripts/setup_case.py)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}

simulationType  RAS;
RAS { RASModel kOmegaSST; turbulence on; printCoeffs off; }
