case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Microfiber filter v8 - OpenFOAM case (values filled by scripts/setup_case.py)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// Background box around the water volume; cell size set by the run script
scale 1;
vertices
(
    (-0.115 -0.055 0.002) ( 0.180 -0.055 0.002) ( 0.180 0.055 0.002) (-0.115 0.055 0.002)
    (-0.115 -0.055 0.256) ( 0.180 -0.055 0.256) ( 0.180 0.055 0.256) (-0.115 0.055 0.256)
);
blocks ( hex (0 1 2 3 4 5 6 7) (@@NX@@ @@NY@@ @@NZ@@) simpleGrading (1 1 1) );
edges ();
boundary ( background { type patch; faces ((0 3 2 1) (4 5 6 7) (0 1 5 4) (1 2 6 5) (2 3 7 6) (3 0 4 7)); } );
