case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  Microfiber filter v8 - OpenFOAM case (values filled by scripts/setup_case.py)
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    fluid.stl
    {
        type triSurfaceMesh;
        name fluid;
        regions
        {
            walls    { name walls; }
            inlet    { name inlet; }
            outlet   { name outlet; }
            overflow { name overflow; }
        }
    }
    bucketRegion { type searchableCylinder; point1 (0 0 0.035); point2 (0 0 0.140); radius 0.0440; }
    meshRegion   { type searchableCylinder; point1 (0 0 0.152); point2 (0 0 0.164); radius 0.0470; }
}

castellatedMeshControls
{
    maxLocalCells       3000000;
    maxGlobalCells      8000000;
    minRefinementCells  10;
    maxLoadUnbalance    0.10;
    nCellsBetweenLevels 2;

    features ( { file "fluid.eMesh"; level @@SURF_LEVEL@@; } );

    refinementSurfaces
    {
        fluid
        {
            level (@@SURF_LEVEL@@ @@SURF_LEVEL@@);
            regions
            {
                walls    { level (@@SURF_LEVEL@@ @@SURF_LEVEL@@); patchInfo { type wall; } }
                inlet    { level (@@SURF_LEVEL@@ @@SURF_LEVEL@@); patchInfo { type patch; } }
                outlet   { level (@@SURF_LEVEL@@ @@SURF_LEVEL@@); patchInfo { type patch; } }
                overflow { level (@@SURF_LEVEL@@ @@SURF_LEVEL@@); patchInfo { type patch; } }
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
        bucketRegion { mode inside; levels ((1e15 @@ZONE_LEVEL@@)); }
        meshRegion   { mode inside; levels ((1e15 @@ZONE_LEVEL@@)); }
    }

    locationInMesh (0.001 0.002 0.200);
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      50;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;
    layers          {}
    expansionRatio  1.2;
    finalLayerThickness 0.4;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    nRelaxIter      3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho         65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave          80;
    minVol              1e-13;
    minTetQuality       1e-15;
    minArea             -1;
    minTwist            0.02;
    minDeterminant      0.001;
    minFaceWeight       0.05;
    minVolRatio         0.01;
    minTriangleTwist    -1;
    nSmoothScale        4;
    errorReduction      0.75;
    relaxed { maxNonOrtho 75; }
}

mergeTolerance 1e-6;
